IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_CBASS0_QOS.xml
<module name="MCU_CBASS0_QOS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="QOS_REGS_Iblazar_mcu_0_vbusp_m_map0" acronym="QOS_REGS_Iblazar_mcu_0_vbusp_m_map0" offset="0x100" width="32" description="The Map Register defines the fields for the master Iblazar_mcu_0.vbusp_m per channel.">
		<bitfield id="EPRIORITY" width="3" begin="14" end="12" resetval="0x7" description="epriority signal for channel N." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="ASEL" width="4" begin="11" end="8" resetval="0x0" description="asel signal for channel N. 0 = SOC address. 1-15 = peripheral address." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="QOS" width="3" begin="2" end="0" resetval="0x0" description="qos signal for channel N." range="2 - 0" rwaccess="R/W"/>
	</register>
</module>